[Survived] LogicalOperator
main/components/Nav/AppNavbar.js:56:55
               }
             </Nav>
             {
-              currentUser && currentUser.loggedIn && (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
+              currentUser && currentUser.loggedIn && (hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
                 <>
                   <Nav.Link as={Link} to="/courses">Courses</Nav.Link>

[Survived] LogicalOperator
main/components/Nav/AppNavbar.js:56:15
               }
             </Nav>
             {
-              currentUser && currentUser.loggedIn && (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
-                <>
-                  <Nav.Link as={Link} to="/courses">Courses</Nav.Link>
-                </>
-              )
+              currentUser && currentUser.loggedIn && (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) || <>
+                  <Nav.Link as={Link} to="/courses">Courses</Nav.Link>
+                </>
             }
             <Nav className="ml-auto">
