[Killed] BooleanLiteral
main/components/Courses/CoursesForm.js:99:55
                     id="start"
                     type="datetime-local"
                     isInvalid={Boolean(errors.start)}
-                    {...register("start", { required: true, pattern: isodate_regex })}
+                    {...register("start", { required: false, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Courses/CoursesForm.js:99:43
                     id="start"
                     type="datetime-local"
                     isInvalid={Boolean(errors.start)}
-                    {...register("start", { required: true, pattern: isodate_regex })}
+                    {...register("start", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:102:22
                     {...register("start", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.start && 'Start Date is required.'}
+                    {true}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:102:22
                     {...register("start", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.start && 'Start Date is required.'}
+                    {errors.start || 'Start Date is required.'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] BooleanLiteral
main/components/Courses/CoursesForm.js:113:53
                     id="end"
                     type="datetime-local"
                     isInvalid={Boolean(errors.end)}
-                    {...register("end", { required: true, pattern: isodate_regex })}
+                    {...register("end", { required: false, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /End Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:116:22
                     {...register("end", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.end && 'End Date is required.'}
+                    {errors.end || 'End Date is required.'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:116:22
                     {...register("end", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.end && 'End Date is required.'}
+                    {true}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /End Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
