[Killed] StringLiteral
main/components/Courses/CoursesTable.js:56:23
         },
         {
             Header: 'End Date (iso format)',
-            accessor: 'end',
+            accessor: "",
         },
         {
killedBy: CoursesTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-end"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
