[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:47:17
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item href="/admin/jobs">Manage Jobs</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:47:17
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item href="/admin/jobs">Manage Jobs</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:56:16
               }
             </Nav>
             {
-              (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
+              (hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
                 <>
                   <Nav.Link as={Link} to="/courses">Courses</Nav.Link>
killedBy: AppNavbar tests renders the courses link correctly for admin
statusReason: Error: Unable to find an element with the text: Courses. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:56:16
               }
             </Nav>
             {
-              (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
+              (true) && (
                 <>
                   <Nav.Link as={Link} to="/courses">Courses</Nav.Link>
killedBy: AppNavbar tests Courses link does NOT show when user is not admin or instructor
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="nav-link" href="/courses">Courses</a> instead
