[Killed] ObjectLiteral
src/main/utils/coursesUtils.js:9:12
 }
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/courses",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
+    return {}
 }
 
killedBy: CoursesUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "method": "DELETE",
-   "params": Object {

[Killed] StringLiteral
src/main/utils/coursesUtils.js:11:17
 export function cellToAxiosParamsDelete(cell) {
     return {
         url: "/api/courses",
-        method: "DELETE",
+        method: "",
         params: {
             id: cell.row.values.id
killedBy: CoursesUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",
