[Killed] BlockStatement
main/pages/Courses/CoursesEditPage.js:3:43
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function CoursesEditPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function CoursesEditPage() {}
 
killedBy: CoursesEditPage tests Renders expected content
statusReason: Error: CoursesEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
