[Killed] BlockStatement
main/pages/Courses/CoursesCreatePage.js:3:45
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function CoursesCreatePage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function CoursesCreatePage() {}
 
killedBy: CoursesCreatePage tests Renders expected content
statusReason: Error: CoursesCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
