[Killed] BlockStatement
main/pages/Courses/CoursesIndexPage.js:3:44
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function CoursesIndexPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p><a href="/courses/create">Create</a></p>
-        <p><a href="/courses/edit/1">Edit</a></p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function CoursesIndexPage() {}
 
killedBy: CoursesIndexPage tests Renders expected content
statusReason: Error: CoursesIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
