[Killed] LogicalOperator
main/components/Courses/CoursesTable.js:65:9
     ];
     
     // console.log(hasRole(currentUser, "ROLE_ADMIN"));
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+    if (hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_INSTRUCTOR")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix));
killedBy: CoursesTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:65:9
     ];
     
     // console.log(hasRole(currentUser, "ROLE_ADMIN"));
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+    if (true) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix));
killedBy: CoursesTable tests Has the expected column headers, content for ordinary user
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="CoursesTable-header-Delete"
  role="columnheader"

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:66:43
     
     // console.log(hasRole(currentUser, "ROLE_ADMIN"));
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
+        columns.push(ButtonColumn("Edit", "", editCallback, testIdPrefix));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix));
     } 
killedBy: CoursesTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
