[Killed] StringLiteral
main/components/Courses/CoursesForm.js:5:69
 import { useForm } from 'react-hook-form';
 import { useNavigate } from 'react-router-dom';
 
-function CoursesForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function CoursesForm({ initialContents, submitAction, buttonLabel = "" }) {
     
     // Stryker disable all
killedBy: CoursesForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Courses/CoursesForm.js:67:44
                     id="school"
                     type="text"
                     isInvalid={Boolean(errors.school)}
-                    {...register("school", {
-                        required: "School is required."
-                    })}
+                    {...register("school", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /School is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Courses/CoursesForm.js:72:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.school?.message}
+                    {errors.school.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:79:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="term">Term</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-term"}
+                    data-testid={testIdPrefix + ""}
                     id="term"
                     type="text"
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesForm-term"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:83:34
                     id="term"
                     type="text"
                     isInvalid={Boolean(errors.term)}
-                    {...register("term", {
+                    {...register("", {
                         required: "Term is required."
                     })}
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Courses/CoursesForm.js:88:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.term?.message}
+                    {errors.term.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
main/components/Courses/CoursesForm.js:99:59
                     id="startDate"
                     type="datetime-local"
                     isInvalid={Boolean(errors.startDate)}
-                    {...register("startDate", { required: true, pattern: isodate_regex })}
+                    {...register("startDate", { required: false, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Courses/CoursesForm.js:99:47
                     id="startDate"
                     type="datetime-local"
                     isInvalid={Boolean(errors.startDate)}
-                    {...register("startDate", { required: true, pattern: isodate_regex })}
+                    {...register("startDate", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:102:22
                     {...register("startDate", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.startDate && 'Start Date is required.'}
+                    {true}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:102:22
                     {...register("startDate", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.startDate && 'Start Date is required.'}
+                    {false}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Courses/CoursesForm.js:113:57
                     id="endDate"
                     type="datetime-local"
                     isInvalid={Boolean(errors.endDate)}
-                    {...register("endDate", { required: true, pattern: isodate_regex })}
+                    {...register("endDate", { required: false, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /End Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:116:22
                     {...register("endDate", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.endDate && 'End Date is required.'}
+                    {errors.endDate || 'End Date is required.'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:116:22
                     {...register("endDate", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.endDate && 'End Date is required.'}
+                    {true}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /End Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Courses/CoursesForm.js:127:47
                     id="githubOrg"
                     type="text"
                     isInvalid={Boolean(errors.githubOrg)}
-                    {...register("githubOrg", {
-                        required: "GitHub Org is required."
-                    })}
+                    {...register("githubOrg", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /GitHub Org is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Courses/CoursesForm.js:132:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.githubOrg?.message}
+                    {errors.githubOrg.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
