[Killed] StringLiteral
main/components/Courses/CoursesTable.js:17:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/courses/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: CoursesTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:56:23
         },
         {
             Header: 'End Date (iso format)',
-            accessor: 'endDate',
+            accessor: "",
         },
         {
killedBy: CoursesTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-endDate"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:58:9
             Header: 'End Date (iso format)',
             accessor: 'endDate',
         },
-        {
-            Header: 'GitHub Org',
-            accessor: 'githubOrg',
-        }
+        {}
     ];
     
killedBy: CoursesTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:59:21
             accessor: 'endDate',
         },
         {
-            Header: 'GitHub Org',
+            Header: "",
             accessor: 'githubOrg',
         }
killedBy: CoursesTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: GitHub Org. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:64:9
         }
     ];
     
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+    if (true) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix));
killedBy: CoursesTable tests Has the expected column headers, content for ordinary user
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="CoursesTable-header-Delete"
  role="columnheader"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:64:9
         }
     ];
     
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+    if (false) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix));
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
