[Killed] ArrayDeclaration
main/components/Jobs/JobsTable.js:8:21
 
     const testid = "JobsTable";
 
-    const columns = [
-        {
-            Header: 'id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
-        DateColumn('Created', (cell)=>cell.row.original.createdAt),
-        DateColumn('Updated', (cell)=>cell.row.original.updatedAt),
-        {
-            Header:'Status',
-            accessor: 'status'
-        },
-        PlaintextColumn('Log', (cell)=>cell.row.original.log),
-    ];
+    const columns = [];
     
     const sortees = React.useMemo(
killedBy: JobsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-wid

[Killed] ArrowFunction
main/components/Jobs/JobsTable.js:13:31
             Header: 'id',
             accessor: 'id', // accessor is the "key" in the data
         },
-        DateColumn('Created', (cell)=>cell.row.original.createdAt),
+        DateColumn('Created', () => undefined),
         DateColumn('Updated', (cell)=>cell.row.original.updatedAt),
         {
killedBy: JobsTable tests Has the expected column headers and content
statusReason: RangeError: Invalid time value

[Killed] ArrowFunction
main/components/Jobs/JobsTable.js:14:31
             accessor: 'id', // accessor is the "key" in the data
         },
         DateColumn('Created', (cell)=>cell.row.original.createdAt),
-        DateColumn('Updated', (cell)=>cell.row.original.updatedAt),
+        DateColumn('Updated', () => undefined),
         {
             Header:'Status',
killedBy: JobsTable tests Has the expected column headers and content
statusReason: RangeError: Invalid time value

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:14:20
             accessor: 'id', // accessor is the "key" in the data
         },
         DateColumn('Created', (cell)=>cell.row.original.createdAt),
-        DateColumn('Updated', (cell)=>cell.row.original.updatedAt),
+        DateColumn("", (cell)=>cell.row.original.updatedAt),
         {
             Header:'Status',
killedBy: JobsTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:17:23
         DateColumn('Updated', (cell)=>cell.row.original.updatedAt),
         {
             Header:'Status',
-            accessor: 'status'
+            accessor: ""
         },
         PlaintextColumn('Log', (cell)=>cell.row.original.log),
killedBy: JobsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="JobsTable-cell-row-0-col-status"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArrowFunction
main/components/Jobs/JobsTable.js:19:32
             Header:'Status',
             accessor: 'status'
         },
-        PlaintextColumn('Log', (cell)=>cell.row.original.log),
+        PlaintextColumn('Log', () => undefined),
     ];
     
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job!Goodbye from test job!
Received:

[Killed] ArrowFunction
main/components/Jobs/JobsTable.js:23:9
     ];
     
     const sortees = React.useMemo(
-        () => [
-          {
-            id: "id",
-            desc: true
-          }
-        ],
+        () => undefined,
        // Stryker disable next-line all
         []
killedBy: JobsTable tests renders without crashing for empty table
statusReason: TypeError: Cannot read properties of undefined (reading 'find')

[Killed] ObjectLiteral
main/components/Jobs/JobsTable.js:24:11
     
     const sortees = React.useMemo(
         () => [
-          {
-            id: "id",
-            desc: true
-          }
+          {}
         ],
        // Stryker disable next-line all
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Killed] BooleanLiteral
main/components/Jobs/JobsTable.js:26:19
         () => [
           {
             id: "id",
-            desc: true
+            desc: false
           }
         ],
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:
  🔼
