[Killed] BlockStatement
main/components/Jobs/PagedJobsTable.js:35:40
 
     const testid = "PagedJobsTable";
 
-    const previousPageCallback = () => {
-        return () => {
-            setSelectedPage(selectedPage - 1);
-        }
-    }
+    const previousPageCallback = () => {}
 
     const nextPageCallback = () => {
killedBy: PagedJobsTable tests renders correct content with multiple pages
statusReason: Error: Unable to find an element with the text: Page: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      2
    </p>

[Killed] BlockStatement
main/components/Jobs/PagedJobsTable.js:36:22
     const testid = "PagedJobsTable";
 
     const previousPageCallback = () => {
-        return () => {
-            setSelectedPage(selectedPage - 1);
-        }
+        return () => {}
     }
 
killedBy: PagedJobsTable tests renders correct content with multiple pages
statusReason: Error: Unable to find an element with the text: Page: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      2
    </p>

[Killed] ArithmeticOperator
main/components/Jobs/PagedJobsTable.js:37:29
 
     const previousPageCallback = () => {
         return () => {
-            setSelectedPage(selectedPage - 1);
+            setSelectedPage(selectedPage + 1);
         }
     }
killedBy: PagedJobsTable tests renders correct content with multiple pages
statusReason: Error: Unable to find an element with the text: Page: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      3
    </p>

[Killed] BlockStatement
main/components/Jobs/PagedJobsTable.js:41:36
         }
     }
 
-    const nextPageCallback = () => {
-        return () => {
-            setSelectedPage(selectedPage + 1);
-        }
-    }
+    const nextPageCallback = () => {}
 
     const columns = [
killedBy: PagedJobsTable tests renders correct content with multiple pages
statusReason: Error: Unable to find an element with the text: Page: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] BlockStatement
main/components/Jobs/PagedJobsTable.js:42:22
     }
 
     const nextPageCallback = () => {
-        return () => {
-            setSelectedPage(selectedPage + 1);
-        }
+        return () => {}
     }
 
killedBy: PagedJobsTable tests renders correct content with multiple pages
statusReason: Error: Unable to find an element with the text: Page: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] ArithmeticOperator
main/components/Jobs/PagedJobsTable.js:43:29
 
     const nextPageCallback = () => {
         return () => {
-            setSelectedPage(selectedPage + 1);
+            setSelectedPage(selectedPage - 1);
         }
     }
killedBy: PagedJobsTable tests renders correct content with multiple pages
statusReason: Error: Unable to find an element with the text: Page: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      0
    </p>

[Killed] StringLiteral
main/components/Jobs/PagedJobsTable.js:52:20
             Header: 'id',
             accessor: 'id', // accessor is the "key" in the data
         },
-        DateColumn('Created', (cell) => cell.row.original.createdAt),
+        DateColumn("", (cell) => cell.row.original.createdAt),
         DateColumn('Updated', (cell) => cell.row.original.updatedAt),
         {
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Jobs/PagedJobsTable.js:54:9
         },
         DateColumn('Created', (cell) => cell.row.original.createdAt),
         DateColumn('Updated', (cell) => cell.row.original.updatedAt),
-        {
-            Header: 'Status',
-            accessor: 'status'
-        },
+        {},
         PlaintextColumn('Log', (cell) => cell.row.original.log),
     ];
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Jobs/PagedJobsTable.js:58:25
             Header: 'Status',
             accessor: 'status'
         },
-        PlaintextColumn('Log', (cell) => cell.row.original.log),
+        PlaintextColumn("", (cell) => cell.row.original.log),
     ];
 
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArithmeticOperator
main/components/Jobs/PagedJobsTable.js:74:23
 
     return (
         <>
-            <p>Page: {selectedPage + 1}</p>
+            <p>Page: {selectedPage - 1}</p>
             <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
             <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages-1}>Next</Button>
killedBy: PagedJobsTable tests renders correct content with multiple pages
statusReason: TestingLibraryElementError: Unable to find an element with the text: Page: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      -1
    </p>

[Killed] ConditionalExpression
main/components/Jobs/PagedJobsTable.js:75:106
     return (
         <>
             <p>Page: {selectedPage + 1}</p>
-            <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
+            <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ false}>Previous</Button>
             <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages-1}>Next</Button>
             < OurTable
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="btn btn-primary" data-testid="PagedJobsTable-previous-button" type="button" />

[Killed] EqualityOperator
main/components/Jobs/PagedJobsTable.js:75:106
     return (
         <>
             <p>Page: {selectedPage + 1}</p>
-            <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
+            <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage !== 0}>Previous</Button>
             <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages-1}>Next</Button>
             < OurTable
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="btn btn-primary" data-testid="PagedJobsTable-previous-button" type="button" />

[Killed] ConditionalExpression
main/components/Jobs/PagedJobsTable.js:76:98
         <>
             <p>Page: {selectedPage + 1}</p>
             <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
-            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages-1}>Next</Button>
+            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={false}>Next</Button>
             < OurTable
                 data={page.content}
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="btn btn-primary" data-testid="PagedJobsTable-next-button" type="button" />

[Killed] ConditionalExpression
main/components/Jobs/PagedJobsTable.js:76:98
         <>
             <p>Page: {selectedPage + 1}</p>
             <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
-            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages-1}>Next</Button>
+            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={false || selectedPage === page.totalPages-1}>Next</Button>
             < OurTable
                 data={page.content}
killedBy: PagedJobsTable tests buttons are disabled where there are zero pages
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="btn btn-primary" data-testid="PagedJobsTable-next-button" type="button" />

[Killed] ObjectLiteral
main/components/Jobs/PagedJobsTable.js:81:31
                 data={page.content}
                 columns={columns}
                 testid={testid}
-                initialState={{ sortBy: sortees }}
+                initialState={{}}
             />
         </>
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:
