[Killed] BooleanLiteral
main/components/Jobs/TestJobForm.js:7:11
 function TestJobForm({ submitAction }) {
 
  const defaultValues = {
-    fail: false,
+    fail: true,
     sleepMs: 1000
 };
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/jobs/launch/testjob?fail=false&sleepMs=0"
Received: "/api/jobs/launch/testjob?fail=true&sleepMs=0"

[Killed] BooleanLiteral
main/components/Jobs/TestJobForm.js:43:22
           data-testid={`${testid}-sleepMs`}
           type="number"
           step="100"
-          isInvalid={!!errors.sleepMs}
+          isInvalid={!errors.sleepMs}
           {...register("sleepMs", {
             required: "sleepMs is required (0 is ok)",
killedBy: TestJobsForm tests validates that sleepMs is present
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/Jobs/TestJobForm.js:44:24
           type="number"
           step="100"
           isInvalid={!!errors.sleepMs}
-          {...register("sleepMs", {
+          {...register("", {
             required: "sleepMs is required (0 is ok)",
             min: { value: 0, message: "sleepMs must be positive" },
killedBy: TestJobsForm tests renders correctly with the right defaults
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Jobs/TestJobForm.js:45:23
           step="100"
           isInvalid={!!errors.sleepMs}
           {...register("sleepMs", {
-            required: "sleepMs is required (0 is ok)",
+            required: "",
             min: { value: 0, message: "sleepMs must be positive" },
             max: { value: 60000, message: "sleepMs must be ≤ 60000" },
killedBy: TestJobsForm tests validates that sleepMs is present
statusReason: TypeError: e is not a function

[Killed] ObjectLiteral
main/components/Jobs/TestJobForm.js:47:18
           {...register("sleepMs", {
             required: "sleepMs is required (0 is ok)",
             min: { value: 0, message: "sleepMs must be positive" },
-            max: { value: 60000, message: "sleepMs must be ≤ 60000" },
+            max: {},
           })}
         />
killedBy: TestJobsForm tests validates that sleepMs is <= 60000
statusReason: TypeError: e is not a function

[Killed] OptionalChaining
main/components/Jobs/TestJobForm.js:51:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.sleepMs?.message}
+          {errors.sleepMs.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: TestJobsForm tests renders correctly with the right defaults
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
