[Killed] BlockStatement
main/components/Nav/Footer.js:3:46
 import { Container } from "react-bootstrap";
 
-export default function Footer({systemInfo}) {
-  return (
-    <footer className="bg-light pt-3 pt-md-4 pb-4 pb-md-5">
-      <Container>
-        <p data-testid="footer-content">
-          Organic is a project of&nbsp;
-          <a href="https://ucsb-cs156.github.io">CS156</a>, 
-          a course at UC Santa Barbara.  Its purpose: provide students and instructors with useful tools to manage
-          Github organizations associated with programming and software engineering courses.
-          The open source code is available on
-          <> </>
-          <a data-testid="github-href" href={systemInfo?.sourceRepo}>GitHub</a>. 
-        </p>
-      </Container>
-    </footer>
-  );
-}
+export default function Footer({systemInfo}) {}
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Footer(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] OptionalChaining
main/components/Nav/Footer.js:14:46
           Github organizations associated with programming and software engineering courses.
           The open source code is available on
           <> </>
-          <a data-testid="github-href" href={systemInfo?.sourceRepo}>GitHub</a>. 
+          <a data-testid="github-href" href={systemInfo.sourceRepo}>GitHub</a>. 
         </p>
       </Container>
killedBy: Footer tests renders correctly when systemInfo.showingNeither
statusReason: TypeError: Cannot read properties of undefined (reading 'sourceRepo')
