[Killed] ConditionalExpression
src/main/components/OurTable.js:26:9
   } = useTable({
     columns,
     data,
-    ...(rest.initialState && {
-      initialState: rest.initialState
-    })
+    ...(false)
   }, useSortBy)
 
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Killed] LogicalOperator
src/main/components/OurTable.js:26:9
   } = useTable({
     columns,
     data,
-    ...(rest.initialState && {
-      initialState: rest.initialState
-    })
+    ...(rest.initialState || {
+  initialState: rest.initialState
+})
   }, useSortBy)
 
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Killed] StringLiteral
src/main/components/OurTable.js:41:32
                 {...column.getHeaderProps(column.getSortByToggleProps())}
                 data-testid={`${testid}-header-${column.id}`}
               >
-                {column.render('Header')}
+                {column.render("")}
                 <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
                   {column.isSorted
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: Renderer Error ☝️

[Killed] StringLiteral
src/main/components/OurTable.js:46:25
                   {column.isSorted
                     ? column.isSortedDesc
                       ? ' 🔽'
-                      : ' 🔼'
+                      : ""
                     : ''}
                 </span>
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Error: Unable to find an element with the text: 🔼. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content;

[Killed] StringLiteral
src/main/components/OurTable.js:47:23
                     ? column.isSortedDesc
                       ? ' 🔽'
                       : ' 🔼'
-                    : ''}
+                    : "Stryker was here!"}
                 </span>
               </th>
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Error: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  Stryker was here!

[Killed] BlockStatement
src/main/components/OurTable.js:119:64
   return column;
 }
 
-export function HrefButtonColumn(label, variant, href, testid) {
-  const column = {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        href={`${href}`}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    )
-  }
-  return column;
-}
+export function HrefButtonColumn(label, variant, href, testid) {}
 
 export function PlaintextColumn(label, getText) {
killedBy: OurTable tests renders an empty table without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
src/main/components/OurTable.js:123:11
   const column = {
     Header: label,
     id: label,
-    Cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        href={`${href}`}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    )
+    Cell: () => undefined
   }
   return column;
killedBy: OurTable tests TestHrefButtonColumn works as it should
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
src/main/components/OurTable.js:126:15
     Cell: ({ cell }) => (
       <Button
         variant={variant}
-        href={`${href}`}
+        href={``}
         data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
       >
killedBy: OurTable tests TestHrefButtonColumn works as it should
statusReason: Error: expect(element).toHaveAttribute("href", "/test") // element.getAttribute("href") === "/test"

Expected the element to have attribute:
  href="/test"
Received:
  href=""

[Killed] BlockStatement
src/main/components/OurTable.js:136:49
   return column;
 }
 
-export function PlaintextColumn(label, getText) {
-  const column = {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => (
-      <Plaintext text={getText(cell)} />
-    )
-  }
-  return column;
-}
+export function PlaintextColumn(label, getText) {}
 
 export function DateColumn(label, getDate) {
killedBy: OurTable tests renders an empty table without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
src/main/components/OurTable.js:140:11
   const column = {
     Header: label,
     id: label,
-    Cell: ({ cell }) => (
-      <Plaintext text={getText(cell)} />
-    )
+    Cell: () => undefined
   }
   return column;
killedBy: OurTable tests TestHrefButtonColumn works as it should
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/main/components/OurTable.js:147:44
   return column;
 }
 
-export function DateColumn(label, getDate) {
-  const options = {
-    year: 'numeric', month: 'numeric', day: 'numeric',
-    hour: 'numeric', minute: 'numeric', second: 'numeric',
-    hour12: false,
-    timeZone: 'America/Los_Angeles'
-  };
-  const column = {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => {
-      const date = new Date(getDate(cell));
-      const formattedDate = new Intl.DateTimeFormat('en-US', options).format(date);
-      return (<>{formattedDate}</>)
-    }
-  }
-  return column;
-}
+export function DateColumn(label, getDate) {}
killedBy: OurTable tests renders an empty table without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
src/main/components/OurTable.js:149:11
 
 export function DateColumn(label, getDate) {
   const options = {
-    year: 'numeric', month: 'numeric', day: 'numeric',
+    year: "", month: 'numeric', day: 'numeric',
     hour: 'numeric', minute: 'numeric', second: 'numeric',
     hour12: false,
killedBy: OurTable tests TestHrefButtonColumn works as it should
statusReason: RangeError: Value  out of range for Intl.DateTimeFormat options property year

[Killed] StringLiteral
src/main/components/OurTable.js:149:29
 
 export function DateColumn(label, getDate) {
   const options = {
-    year: 'numeric', month: 'numeric', day: 'numeric',
+    year: 'numeric', month: "", day: 'numeric',
     hour: 'numeric', minute: 'numeric', second: 'numeric',
     hour12: false,
killedBy: OurTable tests TestHrefButtonColumn works as it should
statusReason: RangeError: Value  out of range for Intl.DateTimeFormat options property month

[Killed] StringLiteral
src/main/components/OurTable.js:150:11
 export function DateColumn(label, getDate) {
   const options = {
     year: 'numeric', month: 'numeric', day: 'numeric',
-    hour: 'numeric', minute: 'numeric', second: 'numeric',
+    hour: "", minute: 'numeric', second: 'numeric',
     hour12: false,
     timeZone: 'America/Los_Angeles'
killedBy: PagedJobsTable tests renders correct content
statusReason: RangeError: Value  out of range for Intl.DateTimeFormat options property hour

[Killed] BooleanLiteral
src/main/components/OurTable.js:151:13
   const options = {
     year: 'numeric', month: 'numeric', day: 'numeric',
     hour: 'numeric', minute: 'numeric', second: 'numeric',
-    hour12: false,
+    hour12: true,
     timeZone: 'America/Los_Angeles'
   };
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  11/13/2022, 19:49:58
Received:
  11/13/2022, 7:49:58 PM

[Killed] StringLiteral
src/main/components/OurTable.js:152:15
     year: 'numeric', month: 'numeric', day: 'numeric',
     hour: 'numeric', minute: 'numeric', second: 'numeric',
     hour12: false,
-    timeZone: 'America/Los_Angeles'
+    timeZone: ""
   };
   const column = {
killedBy: PagedJobsTable tests renders correct content
statusReason: RangeError: Invalid time zone specified:

[Killed] BlockStatement
src/main/components/OurTable.js:157:25
   const column = {
     Header: label,
     id: label,
-    Cell: ({ cell }) => {
-      const date = new Date(getDate(cell));
-      const formattedDate = new Intl.DateTimeFormat('en-US', options).format(date);
-      return (<>{formattedDate}</>)
-    }
+    Cell: ({ cell }) => {}
   }
   return column;
killedBy: OurTable tests TestHrefButtonColumn works as it should
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
