[Killed] BlockStatement
src/main/components/UserProfileTable.js:4:52
 import React from "react";
 import ReactJson from "react-json-view";
 
-export default function UserProfileTable({ user }) {
-    return (
-        <ReactJson src={user} />
-    );
-}
+export default function UserProfileTable({ user }) {}
 
killedBy: UserProfileTable tests renders an empty table without crashing
statusReason: Error: UserProfileTable(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
