[Killed] StringLiteral
main/components/Users/UserEmailsTable.js:6:17
 
 const columns = [
     {
-        Header: 'email',
+        Header: "",
         accessor: 'email', // accessor is the "key" in the data
     },
killedBy: UserEmailsTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-

[Killed] BlockStatement
main/components/Users/UserEmailsTable.js:11:53
     },
 ];
 
-export default function UserEmailsTable({ emails }) {
-    return <OurTable
-        data={emails}
-        columns={columns}
-        testid={"UserEmailsTable"} />;
-};
+export default function UserEmailsTable({ emails }) {};
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: UserEmailsTable(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
