[Killed] BooleanLiteral
main/components/Users/UsersTable.js:6:65
 import { useBackendMutation } from "main/utils/useBackend";
 import { formatTime } from "main/utils/dateUtils";
 
-export default function UsersTable({ users, showToggleButtons = true}) {
+export default function UsersTable({ users, showToggleButtons = false}) {
 
     const columns = [
killedBy: UserTable tests Has the expected column headers and content when toggle is true
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-toggle-admin-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Users/UsersTable.js:10:21
 
     const columns = [
         {
-            Header: 'githubId',
+            Header: "",
             accessor: 'githubId', // accessor is the "key" in the data
         },
statusReason: TestingLibraryElementError: Unable to find an element with the text: githubId. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; m

[Killed] StringLiteral
main/components/Users/UsersTable.js:11:23
     const columns = [
         {
             Header: 'githubId',
-            accessor: 'githubId', // accessor is the "key" in the data
+            accessor: "", // accessor is the "key" in the data
         },
         {
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  11111
Received:

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:17:9
             Header: 'githubLogin',
             accessor: 'githubLogin', // accessor is the "key" in the data
         },
-        {
-            Header: 'fullName',
-            accessor: 'fullName',
-        },
+        {},
         {
             Header: 'Email',
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:19:23
         },
         {
             Header: 'fullName',
-            accessor: 'fullName',
+            accessor: "",
         },
         {
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Phill Conrad
Received:

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:21:9
             Header: 'fullName',
             accessor: 'fullName',
         },
-        {
-            Header: 'Email',
-            accessor: 'email',
-        },
+        {},
         {
             Header: 'Last Online',
killedBy: UserTable tests renders without crashing for empty table without toggle buttons
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Users/UsersTable.js:28:23
         {
             Header: 'Last Online',
             id: 'lastOnline',
-            accessor: (row) => formatTime(row.lastOnline),
+            accessor: () => undefined,
         },
         {
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  11/9/2023
Received:

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:30:9
             id: 'lastOnline',
             accessor: (row) => formatTime(row.lastOnline),
         },
-        {
-            Header: 'Admin',
-            id: 'admin',
-            accessor: (row, _rowIndex) => String(row.admin) // hack needed for boolean values to show up
-        },
+        {},
         {
             Header: 'Instructor',
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:35:9
             id: 'admin',
             accessor: (row, _rowIndex) => String(row.admin) // hack needed for boolean values to show up
         },
-        {
-            Header: 'Instructor',
-            id: 'instructor',
-            accessor: (row, _rowIndex) => String(row.instructor) // hack needed for boolean values to show up
-        },
+        {},
     ];
 
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Users/UsersTable.js:38:23
         {
             Header: 'Instructor',
             id: 'instructor',
-            accessor: (row, _rowIndex) => String(row.instructor) // hack needed for boolean values to show up
+            accessor: () => undefined // hack needed for boolean values to show up
         },
     ];
killedBy: UserTable tests Has the expected column headers and content when toggle is false
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] StringLiteral
main/components/Users/UsersTable.js:88:70
 
     const buttonColumn = [
         ...columns,
-        ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
+        ButtonColumn("toggle-admin", "primary", toggleAdminCallback, ""),
         ButtonColumn("toggle-instructor", "primary", toggleInstructorCallback, "UsersTable")
     ]
killedBy: UserTable tests Has the expected column headers and content when toggle is true
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-toggle-admin-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Users/UsersTable.js:89:43
     const buttonColumn = [
         ...columns,
         ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
-        ButtonColumn("toggle-instructor", "primary", toggleInstructorCallback, "UsersTable")
+        ButtonColumn("toggle-instructor", "", toggleInstructorCallback, "UsersTable")
     ]
     const columnsToDisplay = showToggleButtons ? buttonColumn : columns
killedBy: UserTable tests Has the expected column headers and content when toggle is true
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
