[Killed] BlockStatement
main/components/Utils/Plaintext.js:5:43
 
 // based in part on this SO answer: https://codereview.stackexchange.com/a/211511
 
-export default function Plaintext({text}) {
-  if (text==null) {
-    return (<pre data-testid="plaintext-empty"></pre>)
-  }
-  const textToRender = typeof text === "string" ? text : JSON.stringify(text, null, 2);
-  const [firstLine, ...rest] = textToRender.split('\n')
-  return (
-    <pre data-testid="plaintext">
-      <span>{ firstLine }</span>
-      {
-        rest.map((line, i) => (
-          <Fragment key={i}>
-            <br />
-            <span>{ line }</span>
-          </Fragment>
-        ))
-      }
-    </pre>
-  );
-}
+export default function Plaintext({text}) {}
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: Plaintext(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
main/components/Utils/Plaintext.js:6:7
 // based in part on this SO answer: https://codereview.stackexchange.com/a/211511
 
 export default function Plaintext({text}) {
-  if (text==null) {
+  if (true) {
     return (<pre data-testid="plaintext-empty"></pre>)
   }
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
Received:

[Killed] ConditionalExpression
main/components/Utils/Plaintext.js:6:7
 // based in part on this SO answer: https://codereview.stackexchange.com/a/211511
 
 export default function Plaintext({text}) {
-  if (text==null) {
+  if (false) {
     return (<pre data-testid="plaintext-empty"></pre>)
   }
killedBy: Plaintext tests works on null parameter
statusReason: Error: Unable to find an element by: [data-testid="plaintext-empty"]

<body>
  <div>
    <pre
      data-testid="plaintext"
    >
      <span>

[Killed] EqualityOperator
main/components/Utils/Plaintext.js:9:24
   if (text==null) {
     return (<pre data-testid="plaintext-empty"></pre>)
   }
-  const textToRender = typeof text === "string" ? text : JSON.stringify(text, null, 2);
+  const textToRender = typeof text !== "string" ? text : JSON.stringify(text, null, 2);
   const [firstLine, ...rest] = textToRender.split('\n')
   return (
killedBy: Plaintext tests renders the correct text
statusReason: Error: Unable to find an element with the text: foo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <pre
      data-testid="plaintext"
    >
      <span>

[Killed] ConditionalExpression
main/components/Utils/Plaintext.js:9:24
   if (text==null) {
     return (<pre data-testid="plaintext-empty"></pre>)
   }
-  const textToRender = typeof text === "string" ? text : JSON.stringify(text, null, 2);
+  const textToRender = false ? text : JSON.stringify(text, null, 2);
   const [firstLine, ...rest] = textToRender.split('\n')
   return (
killedBy: Plaintext tests renders the correct text
statusReason: Error: Unable to find an element with the text: foo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <pre
      data-testid="plaintext"
    >
      <span>

[Killed] ArrowFunction
main/components/Utils/Plaintext.js:15:18
     <pre data-testid="plaintext">
       <span>{ firstLine }</span>
       {
-        rest.map((line, i) => (
-          <Fragment key={i}>
-            <br />
-            <span>{ line }</span>
-          </Fragment>
-        ))
+        rest.map(() => undefined)
       }
     </pre>
killedBy: Plaintext tests renders the correct text
statusReason: TestingLibraryElementError: Unable to find an element with the text: bar. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <pre
      data-testid="plaintext"
    >
      <span>
