[Killed] BlockStatement
main/layouts/BasicLayout/BasicLayout.js:7:51
 import { useCurrentUser, useLogout} from "main/utils/currentUser";
 import { useSystemInfo} from "main/utils/systemInfo";
 
-export default function BasicLayout({ children }) {
-
-  const { data: currentUser } = useCurrentUser();
-  const { data: systemInfo } = useSystemInfo();
-
-  const doLogout = useLogout().mutate;
-  
-  return (
-    <div className="d-flex flex-column min-vh-100">
-      <AppNavbar currentUser={currentUser} systemInfo={systemInfo} doLogout={doLogout} />
-      <Container expand="xl" className="pt-4 flex-grow-1">
-        {children}
-      </Container>
-      <Footer systemInfo={systemInfo}/>
-    </div>
-  );
-}
+export default function BasicLayout({ children }) {}
killedBy: LoadingPage tests renders without crashing when lists return empty list
statusReason: Error: BasicLayout(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
