[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:14:49
 
   // *** Test job ***
 
-  const objectToAxiosParamsTestJob = (data) => ({
-    url: `/api/jobs/launch/testjob?fail=${data.fail}&sleepMs=${data.sleepMs}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsTestJob = (data) => ({});
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:26:11
   // Stryker restore all
 
   const submitTestJob = async (data) => {
-    toast("Submitted job: Test Job");
+    toast("");
     testJobMutation.mutate(data);
   };
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Submitted job: Test Job"
Received: ""

Number of calls: 1

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:34:11
 
 const jobLaunchers = [
   {
-    name: "Test Job",
+    name: "",
     form: <TestJobForm submitAction={submitTestJob} />,
   },
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: Unable to find an element with the text: Test Job. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
