[Killed] BlockStatement
src/main/pages/AdminUsersPage.js:6:30
 import UsersTable from "main/components/Users/UsersTable"
 
 import { useUsers } from "main/utils/users";
-const AdminUsersPage = () => {
-
-    const { data: users} = useUsers();
-
-    return (
-        <BasicLayout>
-            <h2>Users</h2>
-            <UsersTable users={users} />
-        </BasicLayout>
-    );
-};
+const AdminUsersPage = () => {};
 
 export default AdminUsersPage;
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: Error: AdminUsersPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
