[Killed] BooleanLiteral
main/pages/Courses/CoursesCreatePage.js:7:54
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function CoursesCreatePage({storybook=false}) {
+export default function CoursesCreatePage({storybook=true}) {
 
   const objectToAxiosParams = (courses) => ({
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /courses
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/courses"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/Courses/CoursesCreatePage.js:9:31
 
 export default function CoursesCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (courses) => ({
-    url: "/api/courses/post",
-    method: "POST",
-    params: {
-      name: courses.name,
-      school: courses.school,
-      term: courses.term,
-      startDate: courses.startDate,
-      endDate: courses.endDate,
-      githubOrg: courses.githubOrg
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (courses) => {
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /courses
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Courses/CoursesCreatePage.js:10:10
 export default function CoursesCreatePage({storybook=false}) {
 
   const objectToAxiosParams = (courses) => ({
-    url: "/api/courses/post",
+    url: "",
     method: "POST",
     params: {
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /courses
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Course Created - id: 3 name: course3"

Number of calls: 0

[Killed] BlockStatement
main/pages/Courses/CoursesCreatePage.js:22:34
     }
   });
 
-  const onSuccess = (courses) => {
-    toast(`New Course Created - id: ${courses.id} name: ${courses.name}`);
-  }
+  const onSuccess = (courses) => {}
 
   const mutation = useBackendMutation(
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /courses
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Course Created - id: 3 name: course3"

Number of calls: 0

[Killed] BlockStatement
main/pages/Courses/CoursesCreatePage.js:39:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/courses" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /courses
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/courses"}

Number of calls: 0
