[Killed] BooleanLiteral
main/pages/Courses/CoursesEditPage.js:8:52
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function CoursesEditPage({storybook=false}) {
+export default function CoursesEditPage({storybook=true}) {
     let { id } = useParams();
 
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/courses"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/Courses/CoursesEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (course) => ({
-        url: "/api/courses/update",
-        method: "PUT",
-        params: {
-            id: course.id,
-        },
-        data: {
-            name: course.name,
-            school: course.school,
-            term: course.term,
-            startDate: course.startDate,
-            endDate: course.endDate,
-            githubOrg: course.githubOrg
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Courses/CoursesEditPage.js:25:14
         );
 
     const objectToAxiosPutParams = (course) => ({
-        url: "/api/courses/update",
+        url: "",
         method: "PUT",
         params: {
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Courses/CoursesEditPage.js:27:17
     const objectToAxiosPutParams = (course) => ({
         url: "/api/courses/update",
         method: "PUT",
-        params: {
-            id: course.id,
-        },
+        params: {},
         data: {
             name: course.name,
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] ObjectLiteral
main/pages/Courses/CoursesEditPage.js:30:15
         params: {
             id: course.id,
         },
-        data: {
-            name: course.name,
-            school: course.school,
-            term: course.term,
-            startDate: course.startDate,
-            endDate: course.endDate,
-            githubOrg: course.githubOrg
-        }
+        data: {}
     });
 
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"name\":\"CS148\",\"school\":\"UCSB\",\"term\":\"S24\",\"startDate\":\"2024-01-01T00:00\",\"endDate\":\"2024-03-31T00:00\",\"githubOrg\":\"ucsb-cs148-w24\"}"
Received: "{}"

[Killed] LogicalOperator
main/pages/Courses/CoursesEditPage.js:66:21
             <div className="pt-2">
                 <h1>Edit Courses</h1>
                 {
-                    course && <CoursesForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={course} />
+                    course || <CoursesForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={course} />
                 }
             </div>
killedBy: CoursesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="CoursesForm-name" id="name" name="name" type="text" /> instead

[Killed] ConditionalExpression
main/pages/Courses/CoursesEditPage.js:66:21
             <div className="pt-2">
                 <h1>Edit Courses</h1>
                 {
-                    course && <CoursesForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={course} />
+                    true
                 }
             </div>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CoursesForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
