[Killed] BlockStatement
main/pages/Courses/CoursesIndexPage.js:23:32
             []
         );
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/courses/create"
-                    style={{ float: "right" }}
-                >
-                    Create Course
-                </Button>
-            )
-        } 
-    }
+    const createButton = () => {}
 
     return (
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/Courses/CoursesIndexPage.js:24:92
         );
 
     const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/courses/create"
-                    style={{ float: "right" }}
-                >
-                    Create Course
-                </Button>
-            )
-        } 
+        if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {} 
     }
 
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Courses/CoursesIndexPage.js:24:13
         );
 
     const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+        if (hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_INSTRUCTOR")) {
             return (
                 <Button
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/Courses/CoursesIndexPage.js:29:28
                 <Button
                     variant="primary"
                     href="/courses/create"
-                    style={{ float: "right" }}
+                    style={{}}
                 >
                     Create Course
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
