[Killed] BlockStatement
src/main/pages/HomePage.js:3:36
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function HomePage() {
-  
-  // Stryker disable all : TODO: restructure this code to avoid the need for this disable
-  return (
-    <div data-testid={"HomePage-main-div"}>
-      <BasicLayout>
-        <h1 data-testid="homePage-title" style={{ fontSize: "75px", borderRadius: "7px", backgroundColor: "white", opacity: ".9" }} className="text-center border-0 my-3">Welcome</h1>
-      </BasicLayout>
-    </div>
-  )
-  // Stryker restore all
-}
+export default function HomePage() {}
 
killedBy: HomePage tests expected CSS properties
statusReason: Error: HomePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
