[Killed] BlockStatement
src/main/pages/LoadingPage.js:3:36
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function HomePage() {  
-  return (
-    <div data-testid={"LoadingPage-main-div"}>
-      <BasicLayout>
-        
-      </BasicLayout>
-    </div>
-  )
-}
+export default function HomePage() {}
 
killedBy: LoadingPage tests renders without crashing when lists return empty list
statusReason: Error: HomePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
