[Killed] BlockStatement
src/main/pages/NotFoundPage.js:5:40
 import React from "react";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function NotFoundPage() {
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>404 Error!</h1>
-                The Page You Are Looking For Does Not Exist Or You Do Not Have Access!
-            </div>
-        </BasicLayout>
-    )
-}
+export default function NotFoundPage() {}
killedBy: NotFoundPage tests renders correctly without crashing
statusReason: Error: NotFoundPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
