[Killed] ObjectLiteral
src/main/pages/ProfilePage.js:20:25
             <p>Not logged in.</p>
         )
     }
-    const displayUser = {
-        ...currentUser,
-        root: {
-          ...currentUser.root,
-          user: {
-            ...currentUser.root.user,
-            lastOnline: timestampToDate(currUser.lastOnline)
-          }
-        }
-      };
+    const displayUser = {};
 
     return (
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of undefined (reading 'user')

[Killed] ObjectLiteral
src/main/pages/ProfilePage.js:24:17
         ...currentUser,
         root: {
           ...currentUser.root,
-          user: {
-            ...currentUser.root.user,
-            lastOnline: timestampToDate(currUser.lastOnline)
-          }
+          user: {}
         }
       };
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  cgaucho
Received:

[Killed] StringLiteral
src/main/pages/ProfilePage.js:33:28
 
     return (
         <BasicLayout>
-            <h1 className={"mb-3"}>
+            <h1 className={""}>
                 User Profile for {currentUser.root.user.githubLogin}
             </h1>
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: expect(element).toHaveClass("mb-3")

Expected the element to have class:
  mb-3
Received:
