[Killed] BlockStatement
src/main/utils/coursesUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/courses/delete",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: CoursesIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Course with id 1 was deleted"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/coursesUtils.js:9:12
 }
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/courses/delete",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
+    return {}
 }
 
killedBy: CoursesIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Course with id 1 was deleted"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
src/main/utils/coursesUtils.js:11:17
 export function cellToAxiosParamsDelete(cell) {
     return {
         url: "/api/courses/delete",
-        method: "DELETE",
+        method: "",
         params: {
             id: cell.row.values.id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",
