[Killed] BlockStatement
src/main/utils/currentUser.js:5:34
 import axios from "axios";
 import { useNavigate } from "react-router-dom"
 
-export function useCurrentUser() {
-  let rolesList = ["ERROR_GETTING_ROLES"];
-  return useQuery("/api/currentUser", async () => {
-    try {
-      const response = await axios.get("/api/currentUser");
-      try {
-        rolesList = response.data.roles.map((r) => r.authority);
-      } catch (e) {
-        console.error("Error getting roles: ", e);
-      }
-      response.data = { ...response.data, rolesList: rolesList }
-      return { loggedIn: true, root: response.data };
-    } catch (e) {
-      console.error("Error invoking axios.get: ", e);
-      return { loggedIn: false, root: null };
-    }
-  }, {
-    initialData: { loggedIn: false, root: null, initialData:true }
-  });
-}
+export function useCurrentUser() {}
 
 export function useLogout() {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _currentUser.useCurrentUser)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/currentUser.js:7:51
 
 export function useCurrentUser() {
   let rolesList = ["ERROR_GETTING_ROLES"];
-  return useQuery("/api/currentUser", async () => {
-    try {
-      const response = await axios.get("/api/currentUser");
-      try {
-        rolesList = response.data.roles.map((r) => r.authority);
-      } catch (e) {
-        console.error("Error getting roles: ", e);
-      }
-      response.data = { ...response.data, rolesList: rolesList }
-      return { loggedIn: true, root: response.data };
-    } catch (e) {
-      console.error("Error invoking axios.get: ", e);
-      return { loggedIn: false, root: null };
-    }
-  }, {
+  return useQuery("/api/currentUser", async () => {}, {
     initialData: { loggedIn: false, root: null, initialData:true }
   });
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"initialData": true, "loggedIn": false, "root": null}
Received: undefined

[Killed] BlockStatement
src/main/utils/currentUser.js:8:9
 export function useCurrentUser() {
   let rolesList = ["ERROR_GETTING_ROLES"];
   return useQuery("/api/currentUser", async () => {
-    try {
-      const response = await axios.get("/api/currentUser");
-      try {
-        rolesList = response.data.roles.map((r) => r.authority);
-      } catch (e) {
-        console.error("Error getting roles: ", e);
-      }
-      response.data = { ...response.data, rolesList: rolesList }
-      return { loggedIn: true, root: response.data };
-    } catch (e) {
+    try {} catch (e) {
       console.error("Error invoking axios.get: ", e);
       return { loggedIn: false, root: null };
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"initialData": true, "loggedIn": false, "root": null}
Received: undefined

[Killed] BlockStatement
src/main/utils/currentUser.js:26:29
   });
 }
 
-export function useLogout() {
-  const queryClient = useQueryClient();
-  const navigate = useNavigate();
-  const mutation = useMutation(async () => {
-    await axios.post("/logout");
-    await queryClient.resetQueries("/api/currentUser", { exact: true });
-    navigate("/");
-  })
-  return mutation;
-}
+export function useLogout() {}
 
 export function hasRole(currentUser, role) {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of undefined (reading 'mutate')

[Killed] BlockStatement
src/main/utils/currentUser.js:29:44
 export function useLogout() {
   const queryClient = useQueryClient();
   const navigate = useNavigate();
-  const mutation = useMutation(async () => {
-    await axios.post("/logout");
-    await queryClient.resetQueries("/api/currentUser", { exact: true });
-    navigate("/");
-  })
+  const mutation = useMutation(async () => {})
   return mutation;
 }
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] ObjectLiteral
src/main/utils/currentUser.js:31:56
   const navigate = useNavigate();
   const mutation = useMutation(async () => {
     await axios.post("/logout");
-    await queryClient.resetQueries("/api/currentUser", { exact: true });
+    await queryClient.resetQueries("/api/currentUser", {});
     navigate("/");
   })
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] BlockStatement
src/main/utils/currentUser.js:37:44
   return mutation;
 }
 
-export function hasRole(currentUser, role) {
-  return currentUser
-    && currentUser.loggedIn
-    && currentUser.root
-    && currentUser.root.rolesList
-    && currentUser.root.rolesList.includes(role)
-}
+export function hasRole(currentUser, role) {}
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser properly defined
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] LogicalOperator
src/main/utils/currentUser.js:38:10
 }
 
 export function hasRole(currentUser, role) {
-  return currentUser
-    && currentUser.loggedIn
-    && currentUser.root
-    && currentUser.root.rolesList
-    && currentUser.root.rolesList.includes(role)
+  return currentUser && currentUser.loggedIn && currentUser.root && currentUser.root.rolesList || currentUser.root.rolesList.includes(role)
 }
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") return falsy when currentUser ill-defined
statusReason: TypeError: Cannot read properties of null (reading 'root')

[Killed] LogicalOperator
src/main/utils/currentUser.js:38:10
 }
 
 export function hasRole(currentUser, role) {
-  return currentUser
-    && currentUser.loggedIn
-    && currentUser.root
-    && currentUser.root.rolesList
+  return currentUser && currentUser.loggedIn && currentUser.root || currentUser.root.rolesList
     && currentUser.root.rolesList.includes(role)
 }
killedBy: AppNavbar tests renders correctly for user that hasn't signed in
statusReason: TypeError: Cannot read properties of undefined (reading 'rolesList')
