[Killed] BlockStatement
src/main/utils/dateUtils.js:30:45
     const dateFromEpoch = new Date(timeString);
     const secondsPast = Math.floor((now - dateFromEpoch) / 1000);
 
-    if (secondsPast < minutesInSeconds * 2) {
-        return 'Online now';
-    }
+    if (secondsPast < minutesInSeconds * 2) {}
 
     if (secondsPast < hourInSeconds) {
killedBy: dateUtils tests formatTime tests should return `Online now` for less than 2 minutes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Online now"
Received: "1 minutes ago"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:34:9
         return 'Online now';
     }
 
-    if (secondsPast < hourInSeconds) {
+    if (false) {
         const minutes = Math.floor(secondsPast / 60);
         return `${minutes} minutes ago`;
killedBy: dateUtils tests formatTime tests should return minutes ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 minutes ago"
Received: "0 hour ago"

[Killed] StringLiteral
src/main/utils/dateUtils.js:36:16
 
     if (secondsPast < hourInSeconds) {
         const minutes = Math.floor(secondsPast / 60);
-        return `${minutes} minutes ago`;
+        return ``;
     }
 
killedBy: dateUtils tests formatTime tests should return minutes ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 minutes ago"
Received: ""

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:39:9
         return `${minutes} minutes ago`;
     }
 
-    if (secondsPast < dayInSeconds) {
+    if (true) {
         const hours = Math.floor(secondsPast / 3600);
         return `${hours} hour${hours > 1 ? 's' : ''} ago`;
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "48 hours ago"

[Killed] EqualityOperator
src/main/utils/dateUtils.js:39:9
         return `${minutes} minutes ago`;
     }
 
-    if (secondsPast < dayInSeconds) {
+    if (secondsPast <= dayInSeconds) {
         const hours = Math.floor(secondsPast / 3600);
         return `${hours} hour${hours > 1 ? 's' : ''} ago`;
killedBy: dateUtils tests formatTime tests should return 1 day ago for 1 day
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1 day ago"
Received: "24 hours ago"

[Killed] EqualityOperator
src/main/utils/dateUtils.js:41:32
 
     if (secondsPast < dayInSeconds) {
         const hours = Math.floor(secondsPast / 3600);
-        return `${hours} hour${hours > 1 ? 's' : ''} ago`;
+        return `${hours} hour${hours >= 1 ? 's' : ''} ago`;
     }
     
killedBy: dateUtils tests formatTime tests should return 1 hour ago for 1 hour
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1 hour ago"
Received: "1 hours ago"

[Killed] EqualityOperator
src/main/utils/dateUtils.js:46:30
     
     if (secondsPast < weekInSeconds) {
         const days = Math.floor(secondsPast / 86400);
-        return `${days} day${days > 1 ? 's' : ''} ago`;
+        return `${days} day${days >= 1 ? 's' : ''} ago`;
     }
 
killedBy: dateUtils tests formatTime tests should return 1 day ago for 1 day
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1 day ago"
Received: "1 days ago"
