[Killed] BlockStatement
src/main/utils/useBackend.js:28:74
 //     []
 // );
 
-export function useBackend(queryKey, axiosParameters, initialData, rest) {
-
-    return useQuery({
-        queryKey: queryKey,
-        queryFn: async () => {
-            try {
-                const response = await axios(axiosParameters);
-                return response.data;
-            } catch (e) {
-                // Stryker disable next-line OptionalChaining
-                if (e.response?.data?.message) {
-                    toast.error(e.response.data.message);
-                } else {
-                    const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-                    toast.error(errorMessage);
-                }
-                throw e;
-            }
-        }, 
-        initialData: initialData,
-        ...rest
-        });
-}
+export function useBackend(queryKey, axiosParameters, initialData, rest) {}
 
 const wrappedParams = async (params) => {
killedBy: PagedJobsTable tests renders correct content
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _useBackend.useBackend)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/useBackend.js:32:30
 
     return useQuery({
         queryKey: queryKey,
-        queryFn: async () => {
-            try {
-                const response = await axios(axiosParameters);
-                return response.data;
-            } catch (e) {
-                // Stryker disable next-line OptionalChaining
-                if (e.response?.data?.message) {
-                    toast.error(e.response.data.message);
-                } else {
-                    const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-                    toast.error(errorMessage);
-                }
-                throw e;
-            }
-        }, 
+        queryFn: async () => {}, 
         initialData: initialData,
         ...rest
killedBy: PagedJobsTable tests renders correct content
statusReason: TypeError: Cannot read properties of undefined (reading 'totalPages')

[Killed] ConditionalExpression
src/main/utils/useBackend.js:38:21
                 return response.data;
             } catch (e) {
                 // Stryker disable next-line OptionalChaining
-                if (e.response?.data?.message) {
+                if (true) {
                     toast.error(e.response.data.message);
                 } else {
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error with no message
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] ObjectLiteral
src/main/utils/useBackend.js:59:80
 export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey = null) {
     const queryClient = useQueryClient();
 
-    return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-        onError: (error) => {
-            // Stryker disable next-line OptionalChaining : we want to check if each nested object is there but we dont want to write tests for each specific case
-            if (error.response?.data?.message) {
-                toast.error(error.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-                toast.error(errorMessage);
-            }
-        },
-        // Stryker disable all : Not sure how to set up the complex behavior needed to test this
-        onSettled: () => {
-            console.log("onSettled", queryKey)
-            if (queryKey !== null)
-                queryClient.invalidateQueries(queryKey);
-        },
-        // Stryker restore all
-        retry: false,
-        ...useMutationParams
-    })
+    return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {})
 }
 
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: Error: Timed out in waitFor after 1000ms.
