[Killed] BlockStatement
src/main/utils/users.js:4:28
 import { useQuery } from "react-query";
 import axios from "axios";
 
-export function useUsers() {
-  return useQuery("users", async () => {
-    const uri = "/api/admin/users";
-    try {
-      const response = await axios.get(uri);     
-      return response.data ;
-    } catch (e) {
-      console.error(`Error getting data from ${uri}:`,e);
-      return [];
-    }
-  }, {
-    initialData: []
-  });
-}
+export function useUsers() {}
 
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _users.useUsers)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/users.js:5:40
 import axios from "axios";
 
 export function useUsers() {
-  return useQuery("users", async () => {
-    const uri = "/api/admin/users";
-    try {
-      const response = await axios.get(uri);     
-      return response.data ;
-    } catch (e) {
-      console.error(`Error getting data from ${uri}:`,e);
-      return [];
-    }
-  }, {
+  return useQuery("users", async () => {}, {
     initialData: []
   });
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: Error: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] BlockStatement
src/main/utils/users.js:7:9
 export function useUsers() {
   return useQuery("users", async () => {
     const uri = "/api/admin/users";
-    try {
-      const response = await axios.get(uri);     
-      return response.data ;
-    } catch (e) {
+    try {} catch (e) {
       console.error(`Error getting data from ${uri}:`,e);
       return [];
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: Error: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] BlockStatement
src/main/utils/users.js:10:17
     try {
       const response = await axios.get(uri);     
       return response.data ;
-    } catch (e) {
-      console.error(`Error getting data from ${uri}:`,e);
-      return [];
-    }
+    } catch (e) {}
   }, {
     initialData: []
killedBy: utils/users tests useUsers tests useUsers initially retrieves initial data on timeout
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] StringLiteral
src/main/utils/users.js:11:21
       const response = await axios.get(uri);     
       return response.data ;
     } catch (e) {
-      console.error(`Error getting data from ${uri}:`,e);
+      console.error(``,e);
       return [];
     }
killedBy: utils/users tests useUsers tests useUsers initially retrieves initial data on timeout
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error getting data from /api/admin/users:"
Received string:    ""

[Killed] ArrayDeclaration
src/main/utils/users.js:12:14
       return response.data ;
     } catch (e) {
       console.error(`Error getting data from ${uri}:`,e);
-      return [];
+      return ["Stryker was here"];
     }
   }, {
killedBy: utils/users tests useUsers tests useUsers hits error logic on 404
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",
